uhnp/src/Reports/ОСВМСФО/ОСВМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОСВМСФО</name>
</mdclass:Report>

uhnp/src/InformationRegisters/СтатусыПериодовСценариев/СтатусыПериодовСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПериодовСценариев</name>
  <resources>
    <name>СтатусПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусБлокировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияРегламента</name>
    <type>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
    </type>
  </resources>
  <attributes>
    <name>УправлениеПериодомСценария</name>
    <type>
      <types>DocumentRef.УправлениеПериодомСценария</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сценарии</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периоды</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организации</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/КорреспонденцииВидовДвиженийМСФО/КорреспонденцииВидовДвиженийМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КорреспонденцииВидовДвиженийМСФО</name>
  <dimensions>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетДт</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКт</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвижения</name>
    <type>
      <types>CatalogRef.ВидыДвиженийМСФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗначенияПоказателейОтчетов6/ЗначенияПоказателейОтчетов6.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПоказателейОтчетов6</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИтоговоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФормированияОтчета</name>
    <type>
      <types>EnumRef.СпособыФормированияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияMs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииЗначенийПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыУчета/ВидыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчета</name>
  <enumValues>
    <name>НСБУ</name>
  </enumValues>
  <enumValues>
    <name>МСФО</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыБухгалтерскихИтогов/ВидыБухгалтерскихИтогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыБухгалтерскихИтогов</name>
  <enumValues>
    <name>СНД</name>
  </enumValues>
  <enumValues>
    <name>СНК</name>
  </enumValues>
  <enumValues>
    <name>ДО</name>
  </enumValues>
  <enumValues>
    <name>КО</name>
  </enumValues>
  <enumValues>
    <name>СКД</name>
  </enumValues>
  <enumValues>
    <name>СКК</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыДетализацииКорреспонденцииСчета/СпособыДетализацииКорреспонденцииСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДетализацииКорреспонденцииСчета</name>
  <enumValues>
    <name>НеРаскрывать</name>
  </enumValues>
  <enumValues>
    <name>РаскрыватьПоВидамДвижений</name>
  </enumValues>
  <enumValues>
    <name>РаскрыватьПоКоррСчетам</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ПланыСчетовБД/ПланыСчетовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыСчетовБД</name>
  <comment>Содержит реквизиты планов счетов текущей и внешних информационных баз, необходимые для настройки выборки</comment>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>МаксимальноеКоличествоСубконто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчетаСубконто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксДт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксКт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчетаОСВ</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетТР</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыСубконто</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидыСубконтоОписание</name>
    <type>
      <types>CatalogRef.ПланыВидовХарактеристикБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМетаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовИсточник</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСиноним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаданныеТекущейИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланСчетовМСФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРегистрБухгалтерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним1</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним2</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаИтогов</name>
    <attributes>
      <name>СчетИтога</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийРеквизит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Синоним2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ВерсииЗначенийПоказателей/ВерсииЗначенийПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииЗначенийПоказателей</name>
  <owners>Catalog.ОписаниеВерсий</owners>
  <attributes>
    <name>ЭкземплярОтчета</name>
    <type>
      <types>DocumentRef.НастраиваемыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Регистратор</name>
    <type>
      <types>DocumentRef.РучныеКорректировки</types>
      <types>DocumentRef.Трансляция</types>
      <types>DocumentRef.КорректировкаЗначенийПоказателей</types>
      <types>DocumentRef.ТрансформационнаяКорректировка</types>
      <types>DocumentRef.НастраиваемыйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьВДополнительнойВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерноваяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Reports/ОСВМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Для каждого ТекущийВариант Из Схема.ВариантыНастроек Цикл
		
		НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, ТекущийВариант.Имя);
		НастройкиВарианта.Описание = ТекущийВариант.Представление;

	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - новая команда отчета.
Функция ДобавитьКомандуОтчета(КомандыОтчетов, КлючВарианта = "") Экспорт
	
	Результат = Неопределено;
	КомандаОтчет 				= КомандыОтчетов.Добавить();
	КомандаОтчет.Менеджер 		= Метаданные.Отчеты.ОСВМСФО.ПолноеИмя();
	Если ЗначениеЗаполнено(КлючВарианта) Тогда
		КомандаОтчет.КлючВарианта = КлючВарианта;
	КонецЕсли;

	КомандаОтчет.Представление 	= НСтр("ru = 'Анализ субконто (МСФО)'");
	КомандаОтчет.МножественныйВыбор 	= Ложь;
	КомандаОтчет.Важность 				= "Обычное";
	КомандаОтчет.ИмяПараметраФормы 		= "Отбор.Субконто1";
	ПараметрыФормы = Новый Структура;
	ДатаНачала = НачалоГода(ТекущаяДата());
	ПериодОтчета = Новый СтандартныйПериод(ДатаНачала, КонецГода(ТекущаяДата()));
	ПараметрыФормы.Вставить("Период", 			ПериодОтчета);
	ПараметрыФормы.Вставить("Сценарий", 		Константы.СценарийМСФО.Получить());
	ПараметрыФормы.Вставить("ВидСубконто", 		ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.СправочникДоговораКонтрагентов);
	//	
	//Результат.Вставить("Организация", 	Ссылка.Организация);
	КомандаОтчет.ПараметрыФормы 		= ПараметрыФормы;
		
	Возврат КомандаОтчет;
	
КонецФункции

#КонецОбласти

#Область ЗависимыеНаборы

Функция ДобавитьЗависимыйНаборДетали(НоваяСКД, ФиксированныеПараметры) Экспорт
	
	//удалим НаборыОстатки если есть
	УдалитьНаборыПоПрефиксу(НоваяСКД, "ДанныеНаНачалоПериода");
	УдалитьНаборыПоПрефиксу(НоваяСКД, "ДанныеНаКонецПериода");
	
	Дт = НСтр("ru = 'По дебету'");
	Кт = НСтр("ru = 'По кредиту'");
	Нач = НСтр("ru = 'На начало периода'");
	Кон = НСтр("ru = 'На конец периода'");

	НаборОСВ = НоваяСКД.НаборыДанных[0];
	ДобавитьПапкиЗависимыхНаборов(НаборОСВ, "ПоДебету", Дт);
	ДобавитьПапкиЗависимыхНаборов(НаборОСВ, "ПоКредиту", Кт);
	
	ПапкиНаборов = Новый Структура("ДанныеДебет, ДанныеКредит", 
		ЗаменыНачало(Нач), ЗаменыКонец(Кон));
		
	МакетРСБУ = ПолучитьМакетОСВРСБУ();
	Для каждого ПапкаНабора Из ПапкиНаборов Цикл
		ДобавитьЗависимыеРСБУ(НоваяСКД, МакетРСБУ, ПапкаНабора.Ключ, ПапкаНабора.Значение);
	КонецЦикла;
	
	//МСФО
	МакетМСФО = ПолучитьМакетОСВМСФО();
	
	Для каждого ПапкаНабора Из ПапкиНаборов Цикл
		ДобавитьЗависимыеМСФО(НоваяСКД, МакетМСФО, ПапкаНабора.Ключ, ПапкаНабора.Значение);
	КонецЦикла;
	
	ДобавитьВидДвиженияТУ(НоваяСКД, МакетМСФО, ФиксированныеПараметры);
	
КонецФункции

Функция ДобавитьЗависимыйНаборОстатки(НоваяСКД, ФиксированныеПараметры) Экспорт
	
	//удалим НаборыДетали если есть
	УдалитьНаборыПоПрефиксу(НоваяСКД, "ДанныеДебет");
	УдалитьНаборыПоПрефиксу(НоваяСКД, "ДанныеКредит");
	
	Нач = НСтр("ru = 'На начало периода'");
	Кон = НСтр("ru = 'На конец периода'");
	
	НаборОСВ = НоваяСКД.НаборыДанных[0];
	ДобавитьПапкиЗависимыхНаборов(НаборОСВ, "НаНачалоПериода", Нач);
	ДобавитьПапкиЗависимыхНаборов(НаборОСВ, "НаКонецПериода", Кон);
		
	ПапкиНаборов = Новый Структура("НаНачалоПериода, НаКонецПериода", 
		ЗаменыНачало(Нач), ЗаменыКонец(Кон));
		
	//РСБУ
	МакетРСБУ = ПолучитьМакетОСВРСБУ();
	Для каждого ПапкаНабора Из ПапкиНаборов Цикл
		ДобавитьЗависимыеРСБУ(НоваяСКД, МакетРСБУ, ПапкаНабора.Ключ, ПапкаНабора.Значение);
	КонецЦикла;
	
	//МСФО
	МакетМСФО = ПолучитьМакетОСВМСФО();
	Для каждого ПапкаНабора Из ПапкиНаборов Цикл
		ДобавитьЗависимыеМСФО(НоваяСКД, МакетМСФО, ПапкаНабора.Ключ, ПапкаНабора.Значение);
	КонецЦикла;
	
	ДобавитьВидДвиженияТУ(НоваяСКД, МакетМСФО, ФиксированныеПараметры);
	
КонецФункции

Процедура НастроитьОграниченияЗависимыхНаборов(НоваяСКД, ВидСубконто) Экспорт
	
	ТипыСубконто = Неопределено;
	Если ВидСубконто <> Неопределено Тогда
		ТипыСубконто = ВидСубконто.ТипЗначения.Типы();
	КонецЕсли;
	
	НаборОСВ = ОсновнойНаборДанных(НоваяСКД);
	ПолеСубконто1 = НаборОСВ.Поля.Найти("Субконто1");
	
	Для каждого Связь Из НоваяСКД.СвязиНаборовДанных Цикл
		
		Если Связь.ВыражениеПриемник <> "Субконто1" Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеСКД = ПолеСКД(НоваяСКД, Связь.НаборДанныхПриемник, Связь.ВыражениеПриемник);
		Если ПолеСКД = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Скрыть = Ложь;
		Если ВидСубконто <> Неопределено Тогда
			Скрыть = Не ЕстьТипВОписанииТипов(ПолеСКД.ТипЗначения, ТипыСубконто);
		КонецЕсли;
		
		УстановитьОграниченияПоля(ПолеСКД, Скрыть, Скрыть, Скрыть, Скрыть);
		
		Если Скрыть ИЛИ ПолеСубконто1 = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеСКД.Заголовок = ПолеСубконто1.Заголовок;
		ПолеСКД.ТипЗначения = ПолеСубконто1.ТипЗначения;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область АОСВ

Функция ТекстЗапросаАОСВ(ФиксированныеПараметры, КлючВарианта) Экспорт
	
	Если ФиксированныеПараметры.ФормироватьПроводкиМСФО Тогда
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = Новый Массив;
	
	ТекстЗапроса.Добавить(ТекстЗапроса_Регламенты(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втВЗП(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПоказателиОтчета(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втОСВМСФО_ТК(НомераТаблиц));
	
	Возврат СтрСоединить(ТекстЗапроса, 
		ПроведениеСерверУХ.РазделительЗапросовВПакете());
	
КонецФункции

#КонецОбласти

Функция ОсновнойНаборДанных(НоваяСКД) Экспорт

	Результат = НоваяСКД.НаборыДанных.Найти("НаборБухИтоги");//АнализСчета,Расшифровки
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат НоваяСКД.НаборыДанных.Найти("НаборДанных1");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СКД

Функция ПолеСКД(СКД, ИмяНабораДанных, ПутьКДаннымПоля) Экспорт
	
	Набор = СКД.НаборыДанных.Найти(ИмяНабораДанных);
	Если Набор = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Поле = Набор.Поля.Найти(ПутьКДаннымПоля);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат Поле;
	
КонецФункции

Функция ТипизироватьПолеСКД(ПолеСКД = Неопределено, ВидСубконто = Неопределено, ЗаголовокПустого = Неопределено) Экспорт
	
	Если ПолеСКД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидСубконто) Тогда
		
		ПолеСКД.ТипЗначения = ВидСубконто.ТипЗначения;
		ПолеСКД.Заголовок = Строка(ВидСубконто);
		
	Иначе 
		
		ПолеСКД.ТипЗначения = Метаданные.ПланыВидовХарактеристик.ВидыСубконтоКорпоративные.Тип;
		ПолеСКД.Заголовок = ?(ЗаголовокПустого = Неопределено, ПолеСКД.Имя, ЗаголовокПустого);
		
	КонецЕсли;

КонецФункции

Функция УстановитьОграниченияПоля(ПолеПриемник, Группировка = Ложь, Поле = Ложь, Порядок = Ложь, Условие = Ложь) Экспорт

	ПолеПриемник.ОграничениеИспользования.Группировка	= Группировка;
	ПолеПриемник.ОграничениеИспользования.Поле			= Поле;
	ПолеПриемник.ОграничениеИспользования.Порядок		= Порядок;
	ПолеПриемник.ОграничениеИспользования.Условие		= Условие;
	
	Если ТипЗнч(ПолеПриемник) <> Тип("ПолеНабораДанныхСхемыКомпоновкиДанных")  Тогда
		Возврат ПолеПриемник;
	КонецЕсли;
	
	ПолеПриемник.ОграничениеИспользованияРеквизитов.Группировка	= Группировка;
	ПолеПриемник.ОграничениеИспользованияРеквизитов.Поле		= Поле;
	ПолеПриемник.ОграничениеИспользованияРеквизитов.Порядок		= Порядок;
	ПолеПриемник.ОграничениеИспользованияРеквизитов.Условие		= Условие;
	
КонецФункции	

Функция ЕстьТипВОписанииТипов(ОписаниеТиповИсточник, ТипыПроверки) Экспорт
	
	Для каждого ТипПроверки Из ТипыПроверки Цикл
		Если ОписаниеТиповИсточник.СодержитТип(ТипПроверки) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ЗависимыеНаборы

Функция ДобавитьЗависимыеМСФО(НоваяСКД, ИсточникСКД, ПапкаНаборов, Замены)
	
	Имя = "ДанныеПоВНАМСФО";
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	Если Метаданные.РегистрыСведений.Найти("СтатусыОбъектовИнвестирования") <> Неопределено Тогда
		
		Имя = "ДанныеПоОбъектуИнвестированияМСФО";
		ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
		ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	КонецЕсли;
	
	Имя = "МестонахождениеВНА";
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	Имя = "ДанныеПоФИМСФО";
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	Имя = "ДанныеРегламента";
	ОписаниеНабора = ОписаниеНабора(Имя, "Организация", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	Имя = "ПараметрыРасчетаРезервовКонтрагенты";
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);

КонецФункции

Процедура ДобавитьВидДвиженияТУ(НоваяСКД, ИсточникСКД, ФиксированныеПараметры)

	//ЭтоТУ = ФиксированныеПараметры.ФормироватьПроводкиМСФО;
	//Если Не ЭтоТУ Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Замены = Новый Структура;
	//
	//Имя = "ВидДвиженияДт";
	//ОписаниеНабора = ОписаниеНабора(Имя, "КорСчет", "", Замены);
	//ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	//
	//Имя = "ВидДвиженияКт";
	//ОписаниеНабора = ОписаниеНабора(Имя, "КорСчет", "", Замены);
	//ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	//
	//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
	//	ИсточникСКД.ВычисляемыеПоля, НоваяСКД.ВычисляемыеПоля);
	
КонецПроцедуры

Функция ДобавитьЗависимыеРСБУ(НоваяСКД, ИсточникСКД, ПапкаНаборов, Замены)
	
	Имя = "ДанныеОС";
	
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	Имя = "ДанныеНМА";
	
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
	Имя = "ДанныеФизЛица";
	
	ОписаниеНабора = ОписаниеНабора(Имя, "Субконто1", ПапкаНаборов, Замены);
	ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора);
	
КонецФункции

Функция ПолучитьМакетОСВМСФО()
	
	МакетМСФО = Отчеты.ОСВМСФО.ПолучитьМакет("ЗависимыеНаборыМСФО");
	НаборВНА = МакетМСФО.НаборыДанных.Найти("ДанныеПоВНАМСФО");
	
	ТекстЗапроса = Отчеты.ПараметрыВНА.ТекстЗапроса_ПараметрыВНА(Неопределено);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&АлгоритмРСБУ", "ИСТИНА");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидыУчета", "ЗНАЧЕНИЕ(Перечисление.ВидыУчета.МСФО)");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Организация", "ИСТИНА");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВсеОрганизации", "ИСТИНА");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВНА", "ИСТИНА");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВсеВНА", "ИСТИНА");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаРасчета", "&ПараметрПериод");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ГраницаДоДокумента", "&ПараметрПериод");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НачалоПериода", "&ПараметрПериод");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНачалаПериодаДокумента", "&ПараметрПериод");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ЛОЖЬ", "И ЛОЖЬ" + СкрытьСубконтоЗапросаВНА());//Параметры вт рб.МСФО
	
	НаборВНА.Запрос = ТекстЗапроса;
	
	Возврат МакетМСФО;
	
КонецФункции

Функция СкрытьСубконтоЗапросаВНА()

	 Возврат
	 "{(Субконто1).* КАК СкрытьСубконто1,
	 |(Субконто2).* КАК СкрытьСубконто2, 
	 |(Субконто3).* КАК СкрытьСубконто3, 
	 |(Сценарий).* КАК СкрытьСценарий, 
	 |(Валюта).* КАК СкрытьВалюта, 
	 |(ВидОперации).* КАК СкрытьВидОперации, 
	 |(Подразделение).* КАК СкрытьПодразделение, 
	 |(НаправлениеДеятельности).* КАК СкрытьНаправлениеДеятельности}";

КонецФункции

Функция ПолучитьМакетОСВРСБУ() 
	
	Если Метаданные.Отчеты.Найти("ОборотноСальдоваяВедомостьПоСчету") = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СКД = Отчеты["ОборотноСальдоваяВедомостьПоСчету"].ПолучитьМакет("СхемаКомпоновкиДанных");
	
	ТипыНаборов = Новый Структура("ДанныеОС, ДанныеНМА, ДанныеФизЛица",
		ВстраиваниеУХКлиентСервер.ПолучитьТипОС(),
		Тип("СправочникСсылка.НематериальныеАктивы"),
		Тип("СправочникСсылка.ФизическиеЛица"));
	
	Для каждого _ Из ТипыНаборов Цикл
		СКД.НаборыДанных[_.Ключ].Поля.Найти("Субконто1").ТипЗначения 
			= Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(_.Значение));
	КонецЦикла;
	
	Возврат СКД;

КонецФункции

Функция ДобавитьНабор(НоваяСКД, ИсточникСКД, ОписаниеНабора)
	
	Если ИсточникСКД = Неопределено Тогда
		Возврат Неопределено;//например в ВЕ нет Отчет.ОборотноСальдоваяВедомостьПоСчету
	КонецЕсли;
	
	НаборОСВ = НоваяСКД.НаборыДанных[0];
	
	Результат = НоваяСКД.НаборыДанных.Найти(ОписаниеНабора.ИмяНовогоНабора);
	Если (Результат <> Неопределено) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Источник = ИсточникСКД.НаборыДанных.Найти(ОписаниеНабора.ИмяСтарогоНабора);
	Если Источник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = НоваяСКД.НаборыДанных.Добавить(ТипЗнч(Источник));
	ЗаполнитьЗначенияСвойств(Результат, Источник, , "Поля, ИсточникДанных");
	
	Результат.Имя				= ОписаниеНабора.ИмяНовогоНабора;
	Результат.Запрос			= ТекстЗапросаНабора(Источник.Запрос, ОписаниеНабора.ЗаменыПараметров);
	Результат.ИсточникДанных	= НоваяСКД.ИсточникиДанных[0].Имя;
	
	//замена префикса полей, 
	//	например, замена пути "Субконто1.СвязанноеПолеМОЛ_ОС" 
	//	на "НаНачалоПериода.ДанныеПоОСРСБУ.СвязанноеПолеМОЛ_ОС"
	ПутьНабора = ОписаниеНабора.ПутьЗамена + "." + ОписаниеНабора.ИмяСтарогоНабора;
	Поиск = ОписаниеНабора.ПутьПоиск + "."; 
	Замена = ПутьНабора + ".";
	
	Для каждого ПолеИсточник Из Источник.Поля Цикл
		
		Поле = Результат.Поля.Добавить(ТипЗнч(ПолеИсточник));
		ЗаполнитьЗначенияСвойств(Поле, ПолеИсточник);
		
		Если ТипЗнч(ПолеИсточник) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
			
			ЗаполнитьЗначенияСвойств(Поле.ОграничениеИспользования, ПолеИсточник.ОграничениеИспользования);
			ЗаполнитьЗначенияСвойств(Поле.ОграничениеИспользованияРеквизитов, ПолеИсточник.ОграничениеИспользованияРеквизитов);
			
		КонецЕсли;
	
		Если Поле.ПутьКДанным = "Заголовок" Тогда
			
			Поле.ПутьКДанным = ПутьНабора;
			//Поле.Заголовок = "!" + ОписаниеНабора.ЗаменыПараметров.Папка;//сместим в начало всех полей-реквизитов
			
		Иначе

			Поле.ПутьКДанным = СтрЗаменить(Поле.ПутьКДанным, Поиск, Замена);
			Если СтрНачинаетсяС(Поле.Заголовок, "Субконто1.") Тогда
				Поле.Заголовок = СтрЗаменить(Поле.Заголовок, "Субконто1.", "");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Связь Из ИсточникСКД.СвязиНаборовДанных Цикл
		
		Если Связь.НаборДанныхПриемник <> ОписаниеНабора.ИмяСтарогоНабора Тогда
			Продолжить;
		КонецЕсли;

		ВыражениеИсточник = Связь.ВыражениеИсточник;//** замена Субконто1 на Субконто2.ОрганизационнаяЕдиница
		
		НоваяСвязьСКД(НоваяСКД, НаборОСВ.Имя, ВыражениеИсточник,
			ОписаниеНабора.ИмяНовогоНабора, Связь.ВыражениеПриемник);
		
	КонецЦикла;
		
	Возврат Результат;

КонецФункции

Функция НоваяСвязьСКД(НоваяСКД, НаборДанныхИсточник, ВыражениеИсточник, 
							НаборДанныхПриемник, ВыражениеПриемник)

	Связь = НоваяСКД.СвязиНаборовДанных.Добавить();
	
	Связь.НаборДанныхИсточник = НаборДанныхИсточник;
	Связь.НаборДанныхПриемник = НаборДанныхПриемник;
	Связь.ВыражениеИсточник = ВыражениеИсточник;
	Связь.ВыражениеПриемник = ВыражениеПриемник;
	
	Возврат Связь;
	
КонецФункции

Функция УдалитьНаборыПоПрефиксу(НоваяСКД, Префикс)

	Имена = ОбщегоНазначения.ВыгрузитьКолонку(НоваяСКД.НаборыДанных, "Имя");
	Для каждого ИмяНабора Из Имена Цикл
		Если СтрНайти(ИмяНабора, Префикс) > 0 Тогда
			НоваяСКД.НаборыДанных.Удалить(НоваяСКД.НаборыДанных[ИмяНабора]);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ЗаменыНачало(ЗаголовокПапки)
	
	Возврат 
	Новый Структура("ПараметрПериод, ПериодСценария, Папка",
		"&НачалоПериода", 
		"&ПериодСценарияНачало", 
		ЗаголовокПапки);
		
КонецФункции

Функция ЗаменыКонец(ЗаголовокПапки)
	
	Возврат 
	Новый Структура("ПараметрПериод, ПериодСценария, Папка",
		"&КонецПериода", 
		"&ПериодСценарияОкончание",
		ЗаголовокПапки);
	
КонецФункции

Функция ТекстЗапросаНабора(Знач ТекстЗапроса, ЗаменыПараметров)

	Для каждого Замена Из ЗаменыПараметров Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"&" + Замена.Ключ, Замена.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ОписаниеНабора(ИмяСтарогоНабора, ПутьПоиск, ПапкаНабора, ЗаменыПараметров)
	
	//ПутьПоиск ;//Ищем "Субконто1" - Путь для присоединения
	ПутьЗамена = ПутьПоиск + "." + ПапкаНабора;//Заменяем на "Субконто1.НаКонецПериода"
	ИмяНовогоНабора = ПапкаНабора + ИмяСтарогоНабора;//Заменяем на "НаКонецПериодаРегламент"
	
	Возврат Новый Структура(
		"ИмяСтарогоНабора, ИмяНовогоНабора, ПапкаНабора, ПутьПоиск, ПутьЗамена, ЗаменыПараметров",
		ИмяСтарогоНабора, ИмяНовогоНабора, ПапкаНабора, ПутьПоиск, ПутьЗамена, ЗаменыПараметров);

КонецФункции

Процедура ДобавитьПапкиЗависимыхНаборов(НаборДанныхОСВ, ИмяПапки, ЗаголовокПапки)

	МестаДобавления = Новый Структура("Организация, Субконто1");
	ПервыйПоПорядку = "!";// первым в порядке полей настроек 
	
	Для каждого Место Из МестаДобавления Цикл
	
		Папка = НаборДанныхОСВ.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
		Папка.ПутьКДанным = Место.Ключ + "." + ИмяПапки;//Организация.НаНачалоПериода
		Папка.Заголовок = ПервыйПоПорядку + ЗаголовокПапки;//Организация.НаНачалоПериода

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстЗапросаАОСВ

Функция ТекстЗапроса_Регламенты(НомераТаблиц)
	
	НомераТаблиц.Вставить("втРегламенты", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	МАКСИМУМ(т.УправлениеПериодомСценария) КАК УОП,
	|	т.Периоды КАК ПериодСценария,
	|	т.Периоды = &ПериодСценарияНачало КАК ЭтоНачало,
	|	т.Периоды = &ПериодСценарияОкончание КАК ЭтоОкончание,
	|	т.Сценарии КАК Сценарий,
	|	ВЫРАЗИТЬ(&ПланСчетовБД КАК Справочник.ПланыСчетовБД).ВидОтчетаОСВ КАК ВидОтчетаОСВ,
	|	МАКСИМУМ(т.ВерсияРегламента) КАК Регламент
	|ПОМЕСТИТЬ втРегламенты
	|ИЗ
	|	РегистрСведений.СтатусыПериодовСценариев КАК т
	|ГДЕ
	|	т.Периоды В(&ПериодыОтчета)
	|	И т.Периоды.Периодичность = ВЫРАЗИТЬ(&ПериодСценарияОкончание КАК Справочник.Периоды).Периодичность
	|	И т.Сценарии = &Сценарий
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Сценарии,
	|	т.Периоды";

КонецФункции

Функция ТекстЗапроса_втВЗП(НомераТаблиц)
	
	НомераТаблиц.Вставить("втВЗП", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	втРегламенты.ЭтоНачало КАК ЭтоНачало,
	|	втРегламенты.ЭтоОкончание КАК ЭтоОкончание,
	|	т.Ссылка КАК Версия,
	|	т.Регистратор КАК Регистратор,
	|	т.Организация КАК Организация,
	|	т.Сценарий КАК Сценарий,
	|	т.Валюта КАК Валюта,
	|	НЕ т.ЗаписьВДополнительнойВалюте КАК ЭтоФВ,
	|	т.Валюта = &ВалютаУчетаДоп КАК ЭтоВО,
	|	т.ВидОперации КАК ВидОперации,
	|	т.ЭкземплярОтчета КАК ЭкземплярОтчета,
	|	т.ВидОтчета КАК ВидОтчета,
	|	т.ПериодОтчета.ДатаОкончания КАК ПериодДень,
	|	т.ПериодОтчета КАК ПериодОтчета
	|ПОМЕСТИТЬ втВЗП
	|ИЗ
	|	Справочник.ВерсииЗначенийПоказателей КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегламенты КАК втРегламенты
	|		ПО т.ВидОтчета = втРегламенты.ВидОтчетаОСВ
	|			И т.Сценарий = втРегламенты.Сценарий
	|			И т.ПериодОтчета = втРегламенты.ПериодСценария
	|ГДЕ
	|	НЕ т.ЧерноваяВерсия
	|	И ВЫБОР
	|			КОГДА НЕ т.ЗаписьВДополнительнойВалюте
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ т.Валюта = &ВалютаУчетаДоп
	|		КОНЕЦ
	|{ГДЕ
	|	т.Организация.*}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	т.Ссылка,
	|	ЭтоОкончание,
	|	ЭтоНачало";

КонецФункции

Функция ТекстЗапроса_втПоказателиОтчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПоказателиОтчета", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	п.ПоказательОтчета КАК ПоказательОтчета,
	|	п.Счет КАК Счет,
	|	п.СчетБД КАК СчетБД,
	|	п.ВидИтогаПоСчету КАК ВидИтогаПоСчету,
	|	п.ТипОстаткаКонНач КАК ТипОстаткаКонНач,
	|	п.БухТипДтКт КАК БухТипДтКт,
	|	п.НомерАналитикиВидыДвижений КАК НомерАналитикиВидыДвижений,
	|	п.НомерАналитикиВидСубконтоОтбор КАК НомерАналитикиВидСубконтоОтбор,
	|	п.НомерРегистра КАК НомерРегистра,
	|	п.ВидАналитики1 КАК ВидАналитики1,
	|	п.ВидАналитики2 КАК ВидАналитики2,
	|	п.ВидАналитики3 КАК ВидАналитики3
	|ПОМЕСТИТЬ втПоказателиОтчета
	|ИЗ
	|	(ВЫБРАТЬ
	|		т.Ссылка КАК ПоказательОтчета,
	|		т.СчетБД.СчетСсылка КАК Счет,
	|		т.СчетБД КАК СчетБД,
	|		т.ВидИтогаПоСчету КАК ВидИтогаПоСчету,
	|		ВЫБОР
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКД), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКК))
	|				ТОГДА ИСТИНА
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНД), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНК))
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК ТипОстаткаКонНач,
	|		ВЫБОР
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКД), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.ДО), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНД))
	|				ТОГДА ИСТИНА
	|			КОГДА т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СКК), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.КО), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.СНК))
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ КАК БухТипДтКт,
	|		ВЫБОР
	|			КОГДА т.СчетБД.ДетализацияКорреспонденцииСчета В (ЗНАЧЕНИЕ(Перечисление.СпособыДетализацииКорреспонденцииСчета.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.СпособыДетализацииКорреспонденцииСчета.НеРаскрывать))
	|				ТОГДА 0
	|			КОГДА НЕ т.ВидИтогаПоСчету В (ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.ДО), ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.КО))
	|				ТОГДА 0
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики1.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 1
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики2.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 2
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики3.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 3
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики4.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 4
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики5.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 5
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики6.ПредставлениеТипа ПОДОБНО ""%Справочник.ВидыДвижений%""
	|				ТОГДА 6
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НомерАналитикиВидыДвижений,
	|		ВЫБОР &ВидСубконто
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики1
	|				ТОГДА 1
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики2
	|				ТОГДА 2
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики3
	|				ТОГДА 3
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики4
	|				ТОГДА 4
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики5
	|				ТОГДА 5
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики6
	|				ТОГДА 6
	|		КОНЕЦ КАК НомерАналитикиВидСубконтоОтбор,
	|		ВЫБОР
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики6 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 6
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики5 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 5
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики4 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 4
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 3
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 2
	|			КОГДА т.ГруппаРаскрытия.ВидАналитики1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 1
	|			КОГДА т.Владелец.ВидАналитики6 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 6
	|			КОГДА т.Владелец.ВидАналитики5 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 5
	|			КОГДА т.Владелец.ВидАналитики4 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 4
	|			КОГДА т.Владелец.ВидАналитики3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 3
	|			КОГДА т.Владелец.ВидАналитики2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 2
	|			КОГДА т.Владелец.ВидАналитики1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НомерРегистра,
	|		т.ГруппаРаскрытия.ВидАналитики1 КАК ВидАналитики1,
	|		т.ГруппаРаскрытия.ВидАналитики2 КАК ВидАналитики2,
	|		т.ГруппаРаскрытия.ВидАналитики3 КАК ВидАналитики3
	|	ИЗ
	|		Справочник.ПоказателиОтчетов КАК т
	|	ГДЕ
	|		т.Владелец В
	|				(ВЫБРАТЬ
	|					т.ВидОтчетаОСВ
	|				ИЗ
	|					втРегламенты КАК т)
	|		И т.СчетБД <> ЗНАЧЕНИЕ(Справочник.СчетаБД.ПустаяСсылка)
	|		И т.ВидИтогаПоСчету <> ЗНАЧЕНИЕ(Перечисление.ВидыБухгалтерскихИтогов.ПустаяСсылка)) КАК п
	|ГДЕ
	|	&УсловиеСчета
	|	И ВЫБОР
	|			КОГДА &ВидСубконто В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ п.НомерАналитикиВидСубконтоОтбор ЕСТЬ NULL
	|		КОНЕЦ
	|{ГДЕ
	|	п.Счет.* КАК Счет}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	п.ПоказательОтчета,
	|	п.НомерРегистра,
	|	ТипОстаткаКонНач"
	
КонецФункции

Функция ТекстЗапроса_втОСВМСФО_ТК(НомераТаблиц)
	
	НомераТаблиц.Вставить("втОСВМСФО", НомераТаблиц.Количество());

	ТекстЗапроса = Новый Массив;
	
	МаксАналитик = 6;
	
	Для й = 1 По МаксАналитик Цикл
		ТекстЗапроса.Добавить(Шаблон_ЗначенияПоказателей(й, МаксАналитик));
	КонецЦикла;
	
	Возврат Шаблон_СводОСВТК(СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ "));
	
КонецФункции

Функция Шаблон_СводОСВТК(ЧастиОСВ)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	тОСВ.ТипОстаткаКонНач КАК ТипОстаткаКонНач,
	|	тОСВ.БухТипДтКт КАК БухТипДтКт,
	|	тОСВ.ПоказательОтчета КАК ПоказательОтчета,
	|	тОСВ.Сценарий КАК Сценарий,
	|	тОСВ.Организация КАК Организация,
	|	тОСВ.АналитикаВалюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА тОСВ.ТипОстаткаКонНач = НЕОПРЕДЕЛЕНО
	|				И тОСВ.БухТипДтКт = ИСТИНА
	|			ТОГДА тОСВ.АналитикаВалюта
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА тОСВ.ТипОстаткаКонНач = НЕОПРЕДЕЛЕНО
	|				И тОСВ.БухТипДтКт = ЛОЖЬ
	|			ТОГДА тОСВ.АналитикаВалюта
	|	КОНЕЦ КАК ВалютаКт,
	|	тОСВ.ВидОперации КАК ВидОперации,
	|	тОСВ.ВидДвижения КАК ВидДвижения,
	|	тОСВ.Регистратор КАК Регистратор,
	|	тОСВ.ВидДвижения КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	NULL КАК ПодразделениеДт,
	|	NULL КАК НаправлениеДеятельностиДт,
	|	NULL КАК ПодразделениеКт,
	|	NULL КАК НаправлениеДеятельностиКт,
	|	тОСВ.ПериодДень КАК ПериодДень,
	|	тОСВ.ПериодДень КАК ПериодНеделя,
	|	тОСВ.ПериодДень КАК ПериодДекада,
	|	тОСВ.ПериодДень КАК ПериодМесяц,
	|	тОСВ.ПериодДень КАК ПериодКвартал,
	|	тОСВ.ПериодДень КАК ПериодПолугодие,
	|	тОСВ.ПериодДень КАК ПериодГод,
	|	тОСВ.Счет КАК Счет,
	|	ЕСТЬNULL(ЕСТЬNULL(ВидДт.СчетКт.СчетСсылка, ВидКт.СчетДт.СчетСсылка), тОСВ.Счет.РазделПланаСчетов) КАК КорСчет,
	|	ЕСТЬNULL(ВидКт.СчетДт.СчетСсылка, тОСВ.Счет) КАК СчетДт,
	|	ЕСТЬNULL(ВидДт.СчетКт.СчетСсылка, тОСВ.Счет) КАК СчетКт,
	|	тОСВ.Аналитика1 КАК СубконтоДт1,
	|	тОСВ.Аналитика2 КАК СубконтоДт2,
	|	тОСВ.Аналитика3 КАК СубконтоДт3,
	|	тОСВ.Аналитика1 КАК СубконтоКт1,
	|	тОСВ.Аналитика2 КАК СубконтоКт2,
	|	тОСВ.Аналитика3 КАК СубконтоКт3,
	|	тОСВ.ВидАналитики1 КАК ВидСубконтоДт1,
	|	тОСВ.ВидАналитики2 КАК ВидСубконтоДт2,
	|	тОСВ.ВидАналитики3 КАК ВидСубконтоДт3,
	|	тОСВ.ВидАналитики1 КАК ВидСубконтоКт1,
	|	тОСВ.ВидАналитики2 КАК ВидСубконтоКт2,
	|	тОСВ.ВидАналитики3 КАК ВидСубконтоКт3,
	|	ЕстьNULL(тОСВ.ВидСубконтоОтбор, тОСВ.Аналитика1) КАК Субконто1,
	|	тОСВ.Аналитика2 КАК Субконто2,
	|	тОСВ.Аналитика3 КАК Субконто3
	|ИЗ
	|	ПараметрОСВ КАК тОСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорреспонденцииВидовДвиженийМСФО КАК ВидДт
	|		ПО (тОСВ.БухТипДтКт = ИСТИНА)
	|			И (тОСВ.ТипОстаткаКонНач = НЕОПРЕДЕЛЕНО)
	|			И (ВидДт.ПланСчетовБД = &ПланСчетовБД)
	|			И тОСВ.Счет = ВидДт.СчетДт
	|			И тОСВ.ВидДвижения = ВидДт.ВидДвижения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорреспонденцииВидовДвиженийМСФО КАК ВидКт
	|		ПО (тОСВ.БухТипДтКт = ЛОЖЬ)
	|			И (тОСВ.ТипОстаткаКонНач = НЕОПРЕДЕЛЕНО)
	|			И (ВидКт.ПланСчетовБД = &ПланСчетовБД)
	|			И тОСВ.Счет = ВидКт.СчетКт
	|			И тОСВ.ВидДвижения = ВидКт.ВидДвижения";
	
	ШаблонПолей = ШаблонПолейОстатка();
	
	ИсточникФВ = "ВЫБОР КОГДА тОСВ.ЭтоФВ ТОГДА тОСВ.Значение КОНЕЦ";
	ИсточникВО = "ВЫБОР КОГДА тОСВ.ЭтоВО ТОГДА тОСВ.Значение КОНЕЦ";
	ИсточникВД = "ВЫБОР КОГДА тОСВ.ЭтоФВ ТОГДА тОСВ.ЗначениеВалюта КОНЕЦ";
	ИсточникКол = "0";
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить(СтрШаблон(ШаблонПолей, "СуммаВВалютеУчета",		ИсточникФВ));
	Ресурсы.Добавить(СтрШаблон(ШаблонПолей, "СуммаВВалютеОтчетности",	ИсточникВО));
	Ресурсы.Добавить(СтрШаблон(ШаблонПолей, "СуммаВВалюте",				ИсточникВД));
	Ресурсы.Добавить(СтрШаблон(ШаблонПолей, "Количество",				ИсточникКол));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ", "ВЫБРАТЬ " + СтрСоединить(Ресурсы, ",") + ", ");
	
	Возврат СтрЗаменить(ТекстЗапроса, "ПараметрОСВ", "(" + ЧастиОСВ + ")");

КонецФункции

Функция ШаблонПолейОстатка(Балансовый = Истина)
	
	Поля = Новый Массив;
	
	Поля.Добавить(ПолеОСВ("НачальныйОстаток",				Ложь, Неопределено, Ложь));
	Поля.Добавить(ПолеОСВ("НачальныйОстатокДт",				Ложь, Истина, Ложь));
	Поля.Добавить(ПолеОСВ("НачальныйОстатокКт",				Ложь, Ложь, Ложь));
	Поля.Добавить(ПолеОСВ("НачальныйРазвернутыйОстатокДт",	Ложь, Истина, Истина));
	Поля.Добавить(ПолеОСВ("НачальныйРазвернутыйОстатокКт",	Ложь, Ложь, Истина));
	
	Если Балансовый Тогда
		Поля.Добавить(ПолеОСВ("",	Неопределено, Неопределено, Ложь));
	Иначе 
		Поля.Добавить(ПолеОСВ("Дт",	Неопределено, Истина, Ложь));
		Поля.Добавить(ПолеОСВ("Кт",	Неопределено, Ложь, Ложь));
	КонецЕсли;
	
	Поля.Добавить(ПолеОСВ("Оборот",		Неопределено, Неопределено, Ложь));
	Поля.Добавить(ПолеОСВ("ОборотДт",	Неопределено, Истина, Ложь));
	Поля.Добавить(ПолеОСВ("ОборотКт",	Неопределено, Ложь, Ложь));
	
	Поля.Добавить(ПолеОСВ("КонечныйОстаток", 				Истина, Неопределено, Ложь));
	Поля.Добавить(ПолеОСВ("КонечныйОстатокДт",				Истина, Истина, Ложь));
	Поля.Добавить(ПолеОСВ("КонечныйОстатокКт",				Истина, Ложь, Ложь));
	Поля.Добавить(ПолеОСВ("КонечныйРазвернутыйОстатокДт",	Истина, Истина, Истина));
	Поля.Добавить(ПолеОСВ("КонечныйРазвернутыйОстатокКт",	Истина, Ложь, Истина));
	
	Возврат СтрСоединить(Поля, ", ");
	
КонецФункции

Функция ПолеОСВ(ПрефиксРесурса, ТипОстатка = Истина, БухТип = Истина, Развернутый = Ложь)
	
	Если БухТип = Неопределено Тогда
		
		ТекстЗапроса =
		" (ВЫБОР
		|			КОГДА тОСВ.ТипОстаткаКонНач = ""%4"" И тОСВ.БухТипДтКт = ИСТИНА 
		|				ТОГДА %2
		|			КОГДА тОСВ.ТипОстаткаКонНач = ""%4"" И тОСВ.БухТипДтКт = ЛОЖЬ 
		|				- ТОГДА %2
		|			КОГДА %5 <> %5 
		|				ТОГДА 0
		|		КОНЕЦ) КАК %1%3";
	
	КонецЕсли;
	
	ТекстЗапроса =
	" (ВЫБОР
	|			КОГДА тОСВ.ТипОстаткаКонНач = %4 И тОСВ.БухТипДтКт = %5
	|				ТОГДА %2
	|		КОНЕЦ) КАК %1%3";
	
	БухТипДебет = БулевоЗапроса(БухТип);
	Если ПрефиксРесурса = "" Тогда
		БухТипДебет = "тОСВ.БухТипДтКт";
	ИначеЕсли БухТип = Неопределено Тогда
		БухТипДебет = "тОСВ.БухТипДтКт";
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, 
		"%1", //Поле-приемник, "СуммаВВалюте"
		"%2", //Поле-источник "тОСВ.ЗначениеВалюта"
		ПрефиксРесурса,// "КонечныйРазвернутыйОстатокДт"
		БулевоЗапроса(ТипОстатка), //Истина - Конечное сальдо
		БухТипДебет); //Истина - Дебет
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция БулевоЗапроса(БулевоПеременная)

	Если БулевоПеременная = Истина Тогда
		Возврат "ИСТИНА"
	ИначеЕсли БулевоПеременная = Ложь Тогда
		Возврат "ЛОЖЬ"
	Иначе 
		Возврат "НЕОПРЕДЕЛЕНО";
	КонецЕсли;

КонецФункции

Функция Шаблон_ЗначенияПоказателей(ЧислоАналитик = 6, МаксАналитик = 6)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	втВЗП.Сценарий КАК Сценарий,
	|	втВЗП.Организация КАК Организация,
	|	втВЗП.ВидОперации КАК ВидОперации,
	|	втВЗП.ПериодДень КАК ПериодДень,
	|	втВЗП.ЭтоФВ КАК ЭтоФВ,
	|	втВЗП.ЭтоВО КАК ЭтоВО,
	|	втВЗП.Регистратор КАК Регистратор,
	|	п.Счет КАК Счет,
	|	п.ВидАналитики1 КАК ВидАналитики1,
	|	п.ВидАналитики2 КАК ВидАналитики2,
	|	п.ВидАналитики3 КАК ВидАналитики3,
	|	п.ТипОстаткаКонНач КАК ТипОстаткаКонНач,
	|	п.БухТипДтКт КАК БухТипДтКт,
	|	ВЫБОР
	|		КОГДА втВЗП.ЭтоФВ
	|			ТОГДА т.ЗначениеВалюта
	|	КОНЕЦ КАК ЗначениеВалюта,
	|	ВЫБОР п.НомерАналитикиВидыДвижений
	|		КОГДА 1
	|			ТОГДА т.Аналитика1
	|		КОГДА 2
	|			ТОГДА т.Аналитика2
	|		КОГДА 3
	|			ТОГДА т.Аналитика3
	|		КОГДА 4
	|			ТОГДА т.Аналитика4
	|		КОГДА 5
	|			ТОГДА т.Аналитика5
	|		КОГДА 6
	|			ТОГДА т.Аналитика6
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР п.НомерАналитикиВидСубконтоОтбор
	|		КОГДА 1
	|			ТОГДА т.Аналитика1
	|		КОГДА 2
	|			ТОГДА т.Аналитика2
	|		КОГДА 3
	|			ТОГДА т.Аналитика3
	|		КОГДА 4
	|			ТОГДА т.Аналитика4
	|		КОГДА 5
	|			ТОГДА т.Аналитика5
	|		КОГДА 6
	|			ТОГДА т.Аналитика6
	|	КОНЕЦ КАК ВидСубконтоОтбор,
	|	т.Показатель КАК ПоказательОтчета,
	|	т.Значение КАК Значение,
	|	т.АналитикаВалюта КАК АналитикаВалюта,
	|	т.Аналитика1 КАК Аналитика1,
	|	т.Аналитика2 КАК Аналитика2,
	|	т.Аналитика3 КАК Аналитика3,
	|	т.Аналитика4 КАК Аналитика4,
	|	т.Аналитика5 КАК Аналитика5,
	|	т.Аналитика6 КАК Аналитика6
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейОтчетов6 КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоказателиОтчета КАК п
	|		ПО т.Показатель = п.ПоказательОтчета
	|			И (п.НомерРегистра = &НомерРегистра)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВЗП КАК втВЗП
	|		ПО т.Версия = втВЗП.Версия
	|ГДЕ
	|	НЕ т.ИтоговоеЗначение
	|	И ВЫБОР
	|			КОГДА втВЗП.ЭтоОкончание
	|					И втВЗП.ЭтоНачало
	|				ТОГДА ИСТИНА
	|			КОГДА п.ТипОстаткаКонНач = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА НЕ втВЗП.ЭтоОкончание
	|					И НЕ втВЗП.ЭтоНачало
	|				ТОГДА ЛОЖЬ
	|			КОГДА НЕ втВЗП.ЭтоОкончание
	|					И втВЗП.ЭтоНачало
	|				ТОГДА п.ТипОстаткаКонНач = ЛОЖЬ
	|			ИНАЧЕ п.ТипОстаткаКонНач = ИСТИНА
	|		КОНЕЦ";
	
	//|			И (п.НомерРегистра = &НомерРегистра)

	ИмяРегистра = "ЗначенияПоказателейОтчетов" + ЧислоАналитик;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗначенияПоказателейОтчетов6", ИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НомерРегистра", ЧислоАналитик);
	
	Для й = ЧислоАналитик + 1 По МаксАналитик Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "т.Аналитика" + й, "NULL");
	КонецЦикла;
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
